#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ssm_parameter.infra_output: Reading...
data.aws_caller_identity.current: Reading...
aws_codedeploy_app.application_main: Refreshing state... [id=b326775b-2c4f-418c-afe6-c643eafbbc4b:app-6]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=app-6-task-execution-role]
aws_iam_role.codedeploy_role: Refreshing state... [id=app-6-code-deploy-role]
aws_iam_policy.custom_codedeploy_policy: Refreshing state... [id=arn:aws:iam::743794601996:policy/app-6-code-deploy-policy]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_iam_role.ecs_task_role: Refreshing state... [id=app-6-task-role]
aws_iam_role_policy_attachment.custom: Refreshing state... [id=app-6-task-execution-role-20241003153209502800000001]
aws_iam_role_policy_attachment.codedeploy_policy_attachement: Refreshing state... [id=app-6-code-deploy-role-20241023021723338900000001]
data.aws_ssm_parameter.infra_output: Read complete after 1s [id=/app-6/output]
aws_iam_policy.secrets_manager_read_policy: Refreshing state... [id=arn:aws:iam::743794601996:policy/app-6-ecs-fargate-secrets-manager-access]
aws_ecs_task_definition.web_app: Refreshing state... [id=app-6]
aws_iam_role_policy_attachment.attach_secrets_read_task_role: Refreshing state... [id=app-6-task-role-20241003153209524100000003]
aws_iam_role_policy_attachment.attach_secrets_read_task_execution_role: Refreshing state... [id=app-6-task-execution-role-20241003153209508300000002]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-2:743794601996:service/app-6/app-6]
aws_codedeploy_deployment_group.application_main: Refreshing state... [id=664c9ff4-b726-4afb-9654-85030ab22491]
local_file.code_deploy_sh: Refreshing state... [id=9154d7cb42eb8c25f0029319f805638df166ab35]
terraform_data.trigger_code_deploy_deployment: Refreshing state... [id=4a0f65d2-2490-7bab-5e75-74806193c840]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.web_app must be replaced
-/+ resource "aws_ecs_task_definition" "web_app" {
      ~ arn                      = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6:71" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-6" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "app-6" -> (known after apply)
      ~ revision                 = 71 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_policy.custom_codedeploy_policy will be destroyed
  # (because aws_iam_policy.custom_codedeploy_policy is not in configuration)
  - resource "aws_iam_policy" "custom_codedeploy_policy" {
      - arn         = "arn:aws:iam::743794601996:policy/app-6-code-deploy-policy" -> null
      - description = "AWS IAM policy for the code deploy role." -> null
      - id          = "arn:aws:iam::743794601996:policy/app-6-code-deploy-policy" -> null
      - name        = "app-6-code-deploy-policy" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecs:CreateTaskSet",
                          - "ecs:DeleteTaskSet",
                          - "ecs:DescribeServices",
                          - "ecs:UpdateServicePrimaryTaskSet",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:us-east-2:743794601996:service/*",
                          - "arn:aws:ecs:us-east-2:743794601996:task-set/*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:CreateListener",
                          - "elasticloadbalancing:CreateRule",
                          - "elasticloadbalancing:CreateTargetGroup",
                          - "elasticloadbalancing:DeleteListener",
                          - "elasticloadbalancing:DeleteRule",
                          - "elasticloadbalancing:DeleteTargetGroup",
                          - "elasticloadbalancing:DeregisterInstancesFromLoadBalancer",
                          - "elasticloadbalancing:DeregisterTargets",
                          - "elasticloadbalancing:DescribeInstanceHealth",
                          - "elasticloadbalancing:DescribeListeners",
                          - "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          - "elasticloadbalancing:DescribeLoadBalancers",
                          - "elasticloadbalancing:DescribeRules",
                          - "elasticloadbalancing:DescribeTargetGroupAttributes",
                          - "elasticloadbalancing:DescribeTargetGroups",
                          - "elasticloadbalancing:DescribeTargetHealth",
                          - "elasticloadbalancing:ModifyListener",
                          - "elasticloadbalancing:ModifyRule",
                          - "elasticloadbalancing:RegisterInstancesWithLoadBalancer",
                          - "elasticloadbalancing:RegisterTargets",
                          - "elasticloadbalancing:SetWebAcl",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:elasticloadbalancing:*:743794601996:listener-rule/app/*/*/*/*",
                          - "arn:aws:elasticloadbalancing:*:743794601996:loadbalancer/net/*/*",
                          - "arn:aws:elasticloadbalancing:*:743794601996:loadbalancer/app/*/*",
                          - "arn:aws:elasticloadbalancing:*:743794601996:targetgroup/*/*",
                          - "arn:aws:elasticloadbalancing:*:743794601996:listener-rule/net/*/*/*/*",
                          - "arn:aws:elasticloadbalancing:*:743794601996:listener/app/*/*/*",
                          - "arn:aws:elasticloadbalancing:*:743794601996:listener/net/*/*/*",
                          - "arn:aws:elasticloadbalancing:*:743794601996:truststore/*/*",
                          - "arn:aws:elasticloadbalancing:*:743794601996:loadbalancer/*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "iam:PassRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::743794601996:role/app-6-task-execution-role",
                          - "arn:aws:iam::743794601996:role/app-6-task-role",
                        ]
                    },
                  - {
                      - Action   = [
                          - "codedeploy:GetDeploymentGroup",
                          - "codedeploy:CreateDeployment",
                          - "codedeploy:GetDeployment",
                          - "codedeploy:GetDeploymentConfig",
                          - "codedeploy:RegisterApplicationRevision",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:codedeploy:us-east-2:743794601996:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPA22LM46AGALTXAO66F" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "Source" = "https://github.com/kunduso/add-aws-ecr-ecs-fargate"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # local_file.code_deploy_sh will be created
  + resource "local_file" "code_deploy_sh" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0755"
      + filename             = "./code_deploy.sh"
      + id                   = (known after apply)
    }

  # terraform_data.trigger_code_deploy_deployment must be replaced
-/+ resource "terraform_data" "trigger_code_deploy_deployment" {
      ~ id               = "4a0f65d2-2490-7bab-5e75-74806193c840" -> (known after apply)
      ~ triggers_replace = <<-EOT
            #!/bin/bash
            set -e
            
            echo "Starting CodeDeploy agent deployment"
            aws --version
            
            echo "Constructing deployment command..."
            COMMAND=$(cat <<EOT
            aws deploy create-deployment \
                --application-name "app-6" \
                --deployment-config-name CodeDeployDefault.ECSAllAtOnce \
                --deployment-group-name "app-6-deploy-group" \
                --revision '{"revisionType": "AppSpecContent", "appSpecContent": {"content": "{\"Resources\":[{\"TargetService\":{\"Properties\":{\"LoadBalancerInfo\":{\"ContainerName\":\"first\",\"ContainerPort\":8080},\"TaskDefinition\":\"arn:aws:ecs:us-east-2:743794601996:task-definition/app-6:71\"},\"Type\":\"AWS::ECS::Service\"}}],\"version\":\"0.0\"}", "sha256":"d4c2f2048c3bc6f15b2d6c7b24f64e1b8151d9e4fa113bf9de6c1823b70e031f"}}' \
                --description "Deployment from Terraform" \
                --output json
            EOT
            )
            
            echo "Command to be executed:"
            echo "$COMMAND"
            
            echo "Executing deployment command..."
            DEPLOYMENT_INFO=$(eval "$COMMAND")
            COMMAND_EXIT_CODE=$?
            
            echo "Command exit code: $COMMAND_EXIT_CODE"
            echo "Raw output:"
            echo "$DEPLOYMENT_INFO"
            
            if [ $COMMAND_EXIT_CODE -ne 0 ]; then
                echo "Error: AWS CLI command failed"
                exit $COMMAND_EXIT_CODE
            fi
            
            echo "Parsing deployment info..."
            if ! DEPLOYMENT_ID=$(echo "$DEPLOYMENT_INFO" | jq -r '.deploymentId'); then
                echo "Error: Failed to parse deployment ID from output"
                exit 1
            fi
            
            if [ "$DEPLOYMENT_ID" == "null" ] || [ -z "$DEPLOYMENT_ID" ]; then
                echo "Error: Deployment ID is null or empty"
                exit 1
            fi
            
            echo "Deployment ID: $DEPLOYMENT_ID"
            
            echo "Deployment created successfully"
        EOT -> (known after apply) # forces replacement
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*